KimiakiK/StickMouse-soft/StickMouse.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
VP_USB_DEVICE_VS_USB_DEVICE_CUSTOM_HID_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CUSTOM_HID_FS
ProjectManager.MainLocation=Core/Src
RCC.I2SFreq_Value=48000000
RCC.MCOFreq_Value=48000000
USB_DEVICE.CLASS_NAME_FS=CUSTOM_HID
RCC.USART1Freq_Value=48000000
ProjectManager.ProjectFileName=StickMouse.ioc
TIM2.Channel-Output\ Compare1\ No\ Output=TIM_CHANNEL_1
TIM17.Prescaler=48
VP_TIM17_VS_ClockSourceINT.Mode=Enable_Timer
USB_DEVICE.CUSTOM_HID_FS_BINTERVAL=0x1
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F042K6Tx
Mcu.PinsNb=15
NVIC.USB_IRQn=true\:0\:0\:false\:false\:true\:false\:true
TIM17.Pulse=2500
USB_DEVICE.USBD_CUSTOM_HID_REPORT_DESC_SIZE=118
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Custom_Hid_FS
RCC.PLLCLKFreq_Value=16000000
PB6.GPIO_PuPd=GPIO_PULLUP
VP_USB_DEVICE_VS_USB_DEVICE_CUSTOM_HID_FS.Mode=CUSTOM_HID_FS
PA0.GPIO_Label=JOYSTICK_V
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false,4-MX_ADC_Init-ADC-false-HAL-true,5-MX_TIM2_Init-TIM2-false-HAL-true
PA11.Mode=Device
ProjectManager.DefaultFWLocation=true
TIM17.OCNPolarity_1=TIM_OCNPOLARITY_LOW
PB6.GPIO_Label=JOYSTICK_BTN
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeletePrevious=true
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS,USBD_MAX_STR_DESC_SIZ,CUSTOM_HID_FS_BINTERVAL,USBD_CUSTOM_HID_REPORT_DESC_SIZE,USBD_CUSTOMHID_OUTREPORT_BUF_SIZE
VP_TIM17_VS_ClockSourceINT.Signal=TIM17_VS_ClockSourceINT
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_HSI48
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_PuPd,GPIO_Label
PA13.Signal=SYS_SWDIO
Mcu.IP4=TIM2
RCC.FCLKCortexFreq_Value=48000000
Mcu.IP5=TIM17
Mcu.IP2=RCC
Mcu.IP3=SYS
PB4.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.IP0=ADC
Mcu.IP1=NVIC
PA12.Signal=USB_DP
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
Mcu.ThirdPartyNb=0
PB7.GPIOParameters=GPIO_ModeDefaultPP,GPIO_Label
RCC.HCLKFreq_Value=48000000
Mcu.IPNb=8
TIM2.IPParameters=Channel-Output Compare1 No Output,Prescaler,Period
ProjectManager.PreviousToolchain=
PB6.Signal=GPIO_Input
PB5.Locked=true
Mcu.Pin6=PB4
PB4.GPIO_PuPd=GPIO_PULLUP
Mcu.Pin7=PB5
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
TIM17.IPParameters=Channel,Prescaler,Period,OCNIdleState_1,Pulse,OCNPolarity_1
ProjectManager.RegisterCallBack=
Mcu.Pin8=PB6
Mcu.Pin9=PB7
PA1.Signal=ADC_IN1
RCC.AHBFreq_Value=48000000
Mcu.Pin0=PA0
Mcu.Pin1=PA1
VP_TIM2_VS_no_output1.Signal=TIM2_VS_no_output1
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA11
Mcu.Pin3=PA12
Mcu.Pin4=PA13
Mcu.Pin5=PA14
ProjectManager.ProjectBuild=false
PB7.GPIO_ModeDefaultPP=GPIO_MODE_AF_OD
VP_TIM2_VS_no_output1.Mode=Output Compare1 No Output
board=custom
TIM17.Channel=TIM_CHANNEL_1
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
RCC.VCOOutput2Freq_Value=8000000
TIM17.Period=4999
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.2
MxDb.Version=DB.6.0.20
PA1.Mode=IN1
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
MxCube.Version=6.2.0
PB4.GPIO_Label=BTN_LEFT
VP_TIM2_VS_ClockSourceINT.Mode=Internal
PA14.Mode=Serial_Wire
File.Version=6
PA0.Mode=IN0
PA1.GPIO_Label=JOYSTICK_H
VP_SYS_VS_Systick.Mode=SysTick
PB7.Signal=TIM17_CH1N
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM2.Period=999
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,CECFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSICECFreq_Value,I2SFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USART1Freq_Value,VCOOutput2Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F042K(4-6)Tx
PB6.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=StickMouse
ProjectManager.UnderRoot=true
PA0.Signal=ADC_IN0
RCC.HSICECFreq_Value=32786.88524590164
Mcu.IP6=USB
RCC.PLLMCOFreq_Value=16000000
Mcu.IP7=USB_DEVICE
ProjectManager.CoupleFile=false
PB4.Locked=true
PB7.GPIO_Label=LED
RCC.SYSCLKFreq_VALUE=48000000
Mcu.Package=LQFP32
PB5.Signal=GPIO_Input
TIM2.Prescaler=48
RCC.TimSysFreq_Value=48000000
PA12.Mode=Device
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PB5.GPIO_PuPd=GPIO_PULLUP
PA14.Locked=true
PA13.Locked=true
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PB7.Mode=PWM Generation1 CH1N
PA11.Signal=USB_DM
PA14.Signal=SYS_SWCLK
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin13=VP_TIM17_VS_ClockSourceINT
Mcu.Pin14=VP_USB_DEVICE_VS_USB_DEVICE_CUSTOM_HID_FS
ProjectManager.ComputerToolchain=false
Mcu.Pin11=VP_TIM2_VS_ClockSourceINT
Mcu.Pin12=VP_TIM2_VS_no_output1
PB5.GPIO_Label=BTN_RIGHT
Mcu.Pin10=VP_SYS_VS_Systick
RCC.CECFreq_Value=32786.88524590164
RCC.APB1TimFreq_Value=48000000
USB_DEVICE.USBD_CUSTOMHID_OUTREPORT_BUF_SIZE=5
RCC.APB1Freq_Value=48000000
USB_DEVICE.VirtualMode=CustomHid
TIM17.OCNIdleState_1=TIM_OCNIDLESTATE_SET
ProjectManager.CustomerFirmwarePackage=
USB_DEVICE.USBD_MAX_STR_DESC_SIZ=512
ProjectManager.DeviceId=STM32F042K6Tx
ProjectManager.LibraryCopy=1
PB4.Signal=GPIO_Input
isbadioc=false
